mozolin/CC2530_Z-Stack_IAR-EW/Projects/zstack/HomeAutomation/cc2530/Source/zcl_cc2530.c
  //-- запускаем повторяемый таймер для информирования о температуре (5 сек)
  osal_start_reload_timer(zclcc2530_TaskID, cc2530_REPORTING_EVT, 5000);
  
  // Старт процесса возвращения в сеть
  bdb_StartCommissioning(BDB_COMMISSIONING_MODE_PARENT_LOST);

  //-- init UART to use "printf" for serial monitor
  HalUARTInit();
  uint8 state = initUart0(uart0RxCb);
  
  printf(FONT_COLOR_GREEN);
  printf("UART initiated\n");
  printf(STYLE_COLOR_RESET);

  
  
  /*
  static const uint8 binary[] = {
		//#include "array.c"
		char str[] = "hello";
		int i;
		int strLength = strlen(str);
		for(i = 0; i < strLength; i++) {
	  	printf("'%c'", str[i]);         	
		}
	};
	*/
  
  /*
  //const uint8 zclcc2530_Test[] = {};
  //uint16 *arr;

  char str[] = "hello";
  //int i;
  int strLength = strlen(str);

  const uint8 zclcc2530_Test[] = {};

  uint16 nnn = strLength + 1;
  uint8 *p[] = {(uint8*)nnn};
  zclcc2530_Test = osal_mem_alloc(nnn);
  if(p == NULL) {
    printf("Unable to allocate memory :(\n");
  }
  printf("Allocated %d bytes of memory\n", nnn);

  p[0] = (uint8*)1;
  p[1] = (uint8*)2;
  p[2] = (uint8*)3;
  p[3] = (uint8*)4;
  p[4] = (uint8*)5;
  p[5] = (uint8*)6;

  //printf("p:%d\n", sizeof(p) * sizeof(uint16));
  printf("p:%d\n", sizeof(p) * sizeof(uint8));
  */

  /*
  arr[0] = strLength;


  printf("length:%d|", strLength);
  for(i = 0; i < strLength; i++) {
    //printf("'%c'", str[i]);
    size++;
    //arr = (uint16*) osal_mem_alloc(size * sizeof(uint16));
    arr = (uint16*) osal_mem_alloc(size);
    arr[i+1] = str[i];
  }

	int n = sizeof(arr);
	printf("n:%d|", n);

  for(i = 0; i < sizeof(arr); i++) {
  	printf("'%c'", arr[i]);
  }
  printf("\n");

	//printf("Array %d\n", sizeof(arr));
	*/
}

// Основной цикл обрабоки событий задачи
uint16 zclcc2530_event_loop(uint8 task_id, uint16 events)
{
  afIncomingMSGPacket_t *MSGpkt;

  //-- Intentionally unreferenced parameter
  (void)task_id;

  if (events & SYS_EVENT_MSG)
  {
    while ((MSGpkt = (afIncomingMSGPacket_t *)osal_msg_receive(zclcc2530_TaskID)))
    {
      switch (MSGpkt->hdr.event)
      {
        case ZCL_INCOMING_MSG:
          //-- Обработка входящего сообщения ZCL Foundation команды/ответа
          zclcc2530_ProcessIncomingMsg((zclIncomingMsg_t *)MSGpkt);
          break;

        case KEY_CHANGE:
          zclcc2530_HandleKeys(((keyChange_t *)MSGpkt)->state, ((keyChange_t *)MSGpkt)->keys);
          break;

        case ZDO_STATE_CHANGE:
          zclcc2530_NwkState = (devStates_t)(MSGpkt->hdr.status);

          //-- Теперь мы в сети
          if((zclcc2530_NwkState == DEV_ZB_COORD) ||
            (zclcc2530_NwkState == DEV_ROUTER)   ||
            (zclcc2530_NwkState == DEV_END_DEVICE)) {
            
            printf(FONT_COLOR_GREEN);
  					printf("Joined network!\n");
  					printf(STYLE_COLOR_RESET);
            
            //-- отключаем мигание
            osal_stop_timerEx(zclcc2530_TaskID, HAL_LED_BLINK_EVENT);
            HalLedSet(HAL_LED_2, HAL_LED_MODE_OFF);
            
            //-- отправляем отчет
            zclcc2530_ReportOnOff();
          }
          break;

        default:
          break;
      }

      osal_msg_deallocate((uint8 *)MSGpkt);
    }

    // возврат необработаных сообщений
    return (events ^ SYS_EVENT_MSG);
  }

  /* Обработка событий приложения */
  
  //-- событие cc2530_EVT_BLINK
  if(events & cc2530_EVT_BLINK)
  {
    printf("Blinking...\n");
    //-- переключим светодиод
    HalLedSet(HAL_LED_2, HAL_LED_MODE_TOGGLE);
    return (events ^ cc2530_EVT_BLINK);
  }
  // событие cc2530_EVT_LONG
  if(events & cc2530_EVT_LONG)
  {
    printf("Long pressed!\n");
    // Проверяем текущее состояние устройства
    // В сети или не в сети?
    if(bdbAttributes.bdbNodeIsOnANetwork) {
      //-- покидаем сеть
      zclcc2530_LeaveNetwork();
      
      printf(FONT_COLOR_RED);
      printf("Leave Network\n");
  		printf(STYLE_COLOR_RESET);
    }
    else 
    {
      // инициируем вход в сеть
      bdb_StartCommissioning(
        BDB_COMMISSIONING_MODE_NWK_FORMATION | 
        BDB_COMMISSIONING_MODE_NWK_STEERING | 
        BDB_COMMISSIONING_MODE_FINDING_BINDING | 
        BDB_COMMISSIONING_MODE_INITIATOR_TL
     );
      // будем мигать пока не подключимся
      osal_start_timerEx(zclcc2530_TaskID, cc2530_EVT_BLINK, 500);
      
      printf(FONT_COLOR_YELLOW);
      printf("Start Commissioning...\n");
  		printf(STYLE_COLOR_RESET);
    }
    
    return (events ^ cc2530_EVT_LONG);
  }
  
  // событие cc2530_REPORTING_EVT
  if(events & cc2530_REPORTING_EVT) {
    
    zclcc2530_ReportTemp();
    
    return (events ^ cc2530_REPORTING_EVT);
  }
  
  // событие опроса кнопок
  if (events & HAL_KEY_EVENT)
  {
    /* Считывание кнопок */
    cc2530_HalKeyPoll();

    return events ^ HAL_KEY_EVENT;
  }
  
  // Отбросим необработаные сообщения
  return 0;
}


// Обработчик нажатий клавиш
static void zclcc2530_HandleKeys(byte shift, byte keys)
{
  if(keys & HAL_KEY_SW_1) {
    //-- Запускаем таймер для определения долгого нажания 5сек
    osal_start_timerEx(zclcc2530_TaskID, cc2530_EVT_LONG, 5000);
    //-- Переключаем реле
    updateRelay(RELAY_STATE == 0);
  } else {
    //-- Останавливаем таймер ожидания долгого нажатия
    osal_stop_timerEx(zclcc2530_TaskID, cc2530_EVT_LONG);
  }

  if(keys & HAL_KEY_SW_2) {
  	printf("Key #2 pressed\n");
  	HalLedSet(HAL_LED_3, HAL_LED_MODE_TOGGLE);
  }

  if(keys & HAL_KEY_SW_3) {
  	P0_4 = (P0_4 == 0) ? 1 : 0;
  	printf("Key #3 pressed: %d\n", P0_4);
  }

}


// Обработчик изменения статусов соединения с сетью
static void zclcc2530_ProcessCommissioningStatus(bdbCommissioningModeMsg_t *bdbCommissioningModeMsg)
{
  switch(bdbCommissioningModeMsg->bdbCommissioningMode)
  {
    case BDB_COMMISSIONING_FORMATION:
      if(bdbCommissioningModeMsg->bdbCommissioningStatus == BDB_COMMISSIONING_SUCCESS)
      {
        //After formation, perform nwk steering again plus the remaining commissioning modes that has not been process yet
        bdb_StartCommissioning(BDB_COMMISSIONING_MODE_NWK_STEERING | bdbCommissioningModeMsg->bdbRemainingCommissioningModes);
      }
      else
      {
        //Want to try other channels?
        //try with bdb_setChannelAttribute
      }
    break;
    case BDB_COMMISSIONING_NWK_STEERING:
      if(bdbCommissioningModeMsg->bdbCommissioningStatus == BDB_COMMISSIONING_SUCCESS)
      {
        //YOUR JOB:
        //We are on the nwk, what now?
      }
      else
      {
        //See the possible errors for nwk steering procedure
        //No suitable networks found
        //Want to try other channels?
        //try with bdb_setChannelAttribute
      }
    break;
    case BDB_COMMISSIONING_FINDING_BINDING:
      if(bdbCommissioningModeMsg->bdbCommissioningStatus == BDB_COMMISSIONING_SUCCESS)
      {
        //YOUR JOB:
      }
      else
      {
        //YOUR JOB:
        //retry?, wait for user interaction?
      }
    break;
    case BDB_COMMISSIONING_INITIALIZATION:
      //Initialization notification can only be successful. Failure on initialization
      //only happens for ZED and is notified as BDB_COMMISSIONING_PARENT_LOST notification

      //YOUR JOB:
      //We are on a network, what now?

    break;
#if ZG_BUILD_ENDDEVICE_TYPE    
    case BDB_COMMISSIONING_PARENT_LOST:
      if(bdbCommissioningModeMsg->bdbCommissioningStatus == BDB_COMMISSIONING_NETWORK_RESTORED)
      {
        //We did recover from losing parent
      }
      else
      {
        //Parent not found, attempt to rejoin again after a fixed delay
        osal_start_timerEx(zclcc2530_TaskID, cc2530_END_DEVICE_REJOIN_EVT, cc2530_END_DEVICE_REJOIN_DELAY);
      }
    break;
#endif 
  }
}


// Обработчик изменения времени идентификации
static void zclcc2530_ProcessIdentifyTimeChange(uint8 endpoint)
{
  (void) endpoint;

  if (zclcc2530_IdentifyTime > 0)
  {
    //HalLedBlink (HAL_LED_2, 0xFF, HAL_LED_DEFAULT_DUTY_CYCLE, HAL_LED_DEFAULT_FLASH_TIME);
  }
  else
  {
    //HalLedSet (HAL_LED_2, HAL_LED_MODE_OFF);
  }
}


//-- Обработчик команды сброса в Basic кластере
static void zclcc2530_BasicResetCB(void)
{
  /* TODO: remember to update this function with any application-specific cluster attribute variables */
  
  zclcc2530_ResetAttributesToDefaultValues();
}

